[
    {
      "author": "Prakitha",
      "title": "The lentin Salab",
      "abstract": "Let's talk about lentils: The best kind to use in  salads are those that do not fall apart when cooked. My favorites are mall green (often sold as lentils du Puy), small brown lentils (sometimes called castelluccio), or even black lentils. Cook them in salted water according to their package directions, or whatever your favorite way to cook lentils is, then cool them before using. ",
      "body": "Place onion, jalapeño, and garlic in a blender or food processor [see Note at end] and run the machine in short bursts until they're in smaller bits. Add two-thirds (just eyeball it) cilantro, drained tomatoes, salt, and juice of one lime and run the machine until the tomatoes are well-chopped but not totally smooth. When making salsa for scooping up with chips, I will add some of the reserved tomato juices, a tablespoon at a time, if the mixture is very thick, but to dress this lentil salad, we don't want it very thin. Adjust seasoning to ensure it's robust enough to dress the lentils, adding salt, pepper, and more lime juice, if needed to taste.",
      "imageUrl": "https://i0.wp.com/live.staticflickr.com/65535/51815628180_bac90e84bf_z.jpg?resize=640%2C427&ssl=1",
      "createdAt":"2021-12-12",
      "comments": [
        {
          "commenter": "hellobib",
          "title": "Must try!",
          "comment":"I can't wait to try this!",
          "commentedAt": "2021-12-14"
        }
      ]
    },{
      "author": "Samrudh",
      "title": "Short-nib onion soup",
      "abstract": "A couple months ago, I was out with friends and we stopped briefly back at a friend's place (hi Jocelyn!). It smelled amazing and it turned out she had chicken chili going in the crockpot. Despite not planning to stay, we inhaled a bowl in her yard before heading back out again and I have not stopped thinking about it since, hospitality on a you-never-know level. Stews and hearty soups are already wired with this energy — they keep well, are easily reheated, and if nobody else eats it, you're happy to have it for yourself.",
      "body": "There are three components here: 1. Oven-braised short ribs, cooking the meat and creating the dreamiest broth. 2. Caramelized onions on the stove, building the soup's base. 3. Cheese croutons to sink into the final soup bowls. Because this is rich, I like to serve it on the smaller side, in 12-ounce (or 1.5-cup) bowls. It's definitely closer to a stew in consistency, but if you'd like it more soup-like, you can add more broth to thin it. You can also, if you wish, broil the cheese toasts on top of the soup, as onion soup is more traditionally served. I used this short rib onion soup as guidance here, but ended up needing more short ribs and using my own, preferred, onion soup method.",
      "imageUrl": "https://i0.wp.com/smittenkitchen.com/wp-content/uploads/2021/12/short-rib-onion-soup-13-scaled.jpg?resize=1536%2C1024&ssl=1",
      "createdAt":"Mar 19, 2021",
      "comments": [
        {
          "commenter": "hiiiindb",
          "title": "Wow!",
          "comment":"I tried it and its yummy",
          "commentedAt": "2021-05-10"
        }
      ]
    },{
      "author": "Manoritha",
      "title": "Checkboard cookies",
      "abstract": " I imagined checkerboard cookies would be a hideous amount of work for something that looked cute but probably didn't taste like much, the dark portions chocolate in color, not flavor.",
      "body": "I used my favorite cookie methods outlined in my Unfussy Sugar Cookies for ease: starting with cold butter and rolling out the dough right away with no floured counter to clean up. A couple quick trips to the freezer firms up the dough, and from there you stack and slice to make the cutest checkerboards I've ever or tasted with no sweat or stress.",
      "imageUrl": "https://i2.wp.com/smittenkitchen.com/wp-content/uploads/2021/12/checkerboard-cookies-1-scaled.jpg?resize=1536%2C1024&ssl=1",
      "createdAt":"Apr 19, 2021",
      "comments": [
        {
          "commenter": "sjkbdcb2tgi",
          "title": "Go for it!",
          "comment":"My kids loved it soo much thank you for the recepie",
          "commentedAt": "2022-01-10"
        }
      ]
    },{
      "author": "Butterscotch",
      "title": "Almond horn cookies",
      "abstract": "The only thing my mother ever asked me to bring home from the bakery where I worked in high school where almond horn cookies, or Mandelhörnchen, probably no surprise as we are a family of established marzipan fiends, most especially when dark chocolate is also involved.",
      "body": "If you have no soft spot for almond paste or almond extract, you should turn away now. It’s almost all they’re made of. They're also naturally flourless, gluten-, leavener- and dairy-free (if you use a dairy-free chocolate); the last time we had a cookie that checked all of these boxes it was all I could talk about for the next six months.      ",
      "imageUrl": "https://i1.wp.com/smittenkitchen.com/wp-content/uploads//2017/04/almond-horns-mandelhoernchen.jpg?fit=750%2C500&ssl=1",
      "createdAt":"May 19, 2021",
      "comments": [
        {
          "commenter": "hetholo",
          "title": "Must try!",
          "comment":"The texture is super",
          "commentedAt": "2021-10-15"
        }
      ]
    }
  ]